print('Введите размерность матрицы: ')
razmer = str(input())

m61 = []
print('Введем элементы матрицы: ')
if razmer == '3x3':
	for i in range(9):
		m61.append(float(input()))
	print(m61[0], m61[1], m61[2])
	print(m61[3], m61[4], m61[5])
	print(m61[6], m61[7], m61[8])

print('''Найдем обратную матрицу:\n''')
print('''Сначала найдем детерминант:\n''')
pofdet11 = (m61[0]*m61[4]*m61[8])
pofdet12 = (m61[2]*m61[3]*m61[7])
pofdet13 = (m61[1]*m61[5]*m61[6])
pofdet21 = (m61[2]*m61[4]*m61[6])
pofdet22 = (m61[0]*m61[7]*m61[5])
pofdet23 = (m61[1]*m61[3]*m61[8])
detA = (pofdet11 + pofdet12 + pofdet13) - (pofdet21 + pofdet22 + pofdet23)
print(detA)

if detA == 0:
	print('Обратной матрицы не существует')
	exit()
else:
	print('Теперь найдем алгебраические дополнения: ')

	A11 = (m61[4]*m61[8]-m61[7]*m61[5])
	A12 = -(m61[3]*m61[8]-m61[6]*m61[5])
	A13 = (m61[3]*m61[7]-m61[6]*m61[4])
	A21 = -(m61[1]*m61[8]-m61[7]*m61[2])
	A22 = (m61[0]*m61[8]-m61[6]*m61[2])
	A23 = -(m61[0]*m61[7]-m61[6]*m61[1])
	A31 = (m61[1]*m61[5]-m61[4]*m61[2])
	A32 = -(m61[0]*m61[5]-m61[3]*m61[2])
	A33 = (m61[0]*m61[4]-m61[3]*m61[1])

	print('Составим матрицу из алгебраических дополнений: ')

	print(A11, A12, A13)
	print(A21, A22, A23)
	print(A31, A32, A33)

print('Транспорируем: ')

print(A11, A21, A31)
print(A12, A22, A32)
print(A13, A23, A33)

print('Теперь посчитаем коэф.: ')

Q = 1/detA
print(Q)

print('Найдем обр. матрицу: ')
B11 = Q*A11
B12 = Q*A12
B13 = Q*A13
B21 = Q*A21
B22 = Q*A22
B23 = Q*A23
B31 = Q*A31
B32 = Q*A32
B33 = Q*A33

print('''Получим:\n''')
print([B11, B12, B13])
print([B21, B22, B23])
print([B31, B32, B33])

